{
  "intro": "Experience interactive simulations and visualizations that make learning intuitive and engaging",
  "explore-button": "Explore Features",
  "about-button": "About Us",
  "intro-button": "Interactive Learning Reimageined",
  "intro-sub": "Our interactive playground helps you visualize and understand complex concepts through engaging simulations and hands-on experiences.",
  "algo-visual": "Algorithm Visualization",
  "algo-visual-sub": "Step through complex algorithms visually and understand how they work internally through our intuitive visualizations.",
  "pathfind": "Pathfinding",
  "pathfind-sub": "Watch A* and Dijkstra's algorithms find paths in real-time",
  "sorting": "Sorting",
  "sorting-sub": "Compare different sorting algorithms side by side",
  "data-struct": "Data Structures",
  "data-struct-sub": "Explore trees, graphs, and other complex structures visually",
  "ai": "AI Experimantation (coming soon)",
  "ai-sub": "Explore the world of AI through hands-on interactive demos that make complex concepts approachable and engaging.",
  "nn": "Neural Networks",
  "nn-sub": "Visualize how neural networks learn and make decisions",
  "ml": "Machine Learning",
  "ml-sub": "Train models on different datasets and see results instantly",
  "rein": "Reinforcement Learning",
  "rein-sub": "Watch AI agents learn to solve problems through trial and error",
  "physics": "Interactive Physics (coming soon)",
  "physics-sub": "Experiment with our interactive cloth simulation powered by Matter.js. Control physics properties, manipulate objects, and see real-time reactions.",
  "cutting": "Cutting Action (On Development)",
  "cutting-sub": "Cut through the cloth with improved detection radius and visual feedback",
  "pins": "Adjustable Pins",
  "pins-sub": "Drag and move pins at cloth corners to create different cloth behaviors",
  "controls": "Physics Controls",
  "controls-sub": "Adjust stiffness, friction and particle size to stimulate different materials",
  "cloth": "Interactive Cloth Physics",
  "cloth-sub": "Dive into a dynamic cloth simulation powered by Matter.js. Tweak properties like stiffness, friction and gravity to see how they shape the fabric behavior in real time.",
  "realistic-cloth": "Realistic Cloth Dynamics",
  "realistic-cloth-sub": "Experience a cutting-edge cloth simulation driven by the Matter.js physics engine. Adjust parameters and interact with the fabric to explore its lifelike behavior.",
  "realistic-cloth-1": "Fine-tune stiffness, friction, and particle size",
  "realistic-cloth-2": "Simulate wind and gravity effects",
  "realistic-cloth-3": "Interact with dynamic objects like balls",
  "dijkstra": "Visualize and compare these two popular pathfinding algorithms in real-time. Watch how they explore the grid differently to find the optimal path."
}
