{
  "intro": "สัมผัสประสบการณ์การจำลองและการแสดงภาพที่ทำให้การเรียนรู้เข้าใจง่ายและน่าสนใจ",
  "explore-button": "สำรวจฟีเจอร์",
  "about-button": "เกี่ยวกับเรา",
  "intro-button": "นิยามใหม่แห่งการเรียนรู้แบบอินเทอร์แอคทีฟ",
  "intro-sub": "สนามเรียนรู้เชิงอินเทอร์แอคทีฟของเราช่วยให้คุณเข้าใจแนวคิดที่ซับซ้อนได้ง่ายขึ้นผ่านการจำลองและการมีส่วนร่วม",
  "algo-visual": "การแสดงผลอัลกอริธึม",
  "algo-visual-sub": "เรียนรู้อัลกอริธึมอย่างลึกซึ้งผ่านการจำลองแบบก้าวต่อก้าว พร้อมภาพประกอบที่เข้าใจง่าย",
  "pathfind": "ค้นหาเส้นทาง",
  "pathfind-sub": "ชมการทำงานของอัลกอริธึม A* และ Dijkstra ในการค้นหาเส้นทางแบบเรียลไทม์",
  "sorting": "การเรียงลำดับ",
  "sorting-sub": "เปรียบเทียบอัลกอริธึมการเรียงลำดับหลายแบบในมุมมองเดียว",
  "data-struct": "โครงสร้างข้อมูล",
  "data-struct-sub": "สำรวจโครงสร้างข้อมูลที่ซับซ้อน เช่น ต้นไม้และกราฟ ด้วยภาพแบบอินเทอร์แอคทีฟ",
  "ai": "การทดลองด้าน AI (เร็ว ๆ นี้)",
  "ai-sub": "เรียนรู้เกี่ยวกับ AI ผ่านการจำลองและการทดลองที่เข้าใจง่ายและมีส่วนร่วม",
  "nn": "โครงข่ายประสาทเทียม",
  "nn-sub": "ชมกระบวนการเรียนรู้และการตัดสินใจของโครงข่ายประสาทเทียมแบบอินเทอร์แอคทีฟ",
  "ml": "การเรียนรู้ของเครื่อง",
  "ml-sub": "ฝึกโมเดลจากชุดข้อมูลต่าง ๆ และดูผลลัพธ์แบบเรียลไทม์",
  "rein": "การเรียนรู้แบบเสริมแรง",
  "rein-sub": "ดูเอเจนต์ AI ฝึกแก้ปัญหาผ่านการลองผิดลองถูก",
  "physics": "ฟิสิกส์แบบอินเทอร์แอคทีฟ (เร็ว ๆ นี้)",
  "physics-sub": "ทดลองการจำลองผ้าด้วย Matter.js ปรับค่าฟิสิกส์และโต้ตอบกับวัตถุได้แบบเรียลไทม์",
  "cutting": "การตัดผ้า (อยู่ระหว่างพัฒนา)",
  "cutting-sub": "จำลองการตัดผ้าพร้อมระบบตรวจจับและแสดงผลที่แม่นยำ",
  "pins": "หมุดปรับตำแหน่ง",
  "pins-sub": "ลากและวางหมุดที่มุมผ้าเพื่อเปลี่ยนพฤติกรรมการเคลื่อนไหว",
  "controls": "การควบคุมฟิสิกส์",
  "controls-sub": "ปรับค่าความแข็งแรง ความฝืด และขนาดอนุภาคเพื่อจำลองวัสดุต่าง ๆ",
  "cloth": "การจำลองผ้าแบบอินเทอร์แอคทีฟ",
  "cloth-sub": "ดำดิ่งสู่การจำลองผ้าแบบไดนามิกที่ขับเคลื่อนด้วย Matter.js ปรับคุณสมบัติต่าง ๆ เช่น ความแข็ง ความฝืด และแรงโน้มถ่วง เพื่อดูผลลัพธ์ต่อพฤติกรรมของผ้าแบบเรียลไทม์",
  "realistic-cloth": "การจำลองผ้าที่สมจริง",
  "realistic-cloth-sub": "สัมผัสการจำลองผ้าระดับล้ำด้วยเอนจินฟิสิกส์ Matter.js ปรับค่าพารามิเตอร์และโต้ตอบกับผ้าเพื่อสำรวจพฤติกรรมที่เหมือนจริง",
  "realistic-cloth-1": "ปรับค่าความแข็ง ความฝืด และขนาดอนุภาคได้ตามต้องการ",
  "realistic-cloth-2": "จำลองแรงลมและแรงโน้มถ่วง",
  "realistic-cloth-3": "โต้ตอบกับวัตถุเคลื่อนไหว เช่น ลูกบอล",
  "dijkstra": "แสดงภาพและเปรียบเทียบอัลกอริธึมหาเส้นทางยอดนิยมทั้งสองแบบแบบเรียลไทม์ ชมวิธีที่พวกมันสำรวจกริดแตกต่างกันเพื่อค้นหาเส้นทางที่เหมาะสมที่สุด"
}
