{
  "title": "การแสดงภาพโครงสร้างข้อมูลเชิงเส้น",
  "title-sub": "สำรวจการแสดงภาพต่าง ๆ ของโครงสร้างข้อมูลเชิงเส้นและอัลกอริธึม ที่ซึ่งองค์ประกอบถูกจัดเรียงในลำดับแบบเส้นตรง",
  "linear-card-title": "เกี่ยวกับโครงสร้างข้อมูลแบบเชิงเส้น",
  "linear-card-desc": "แนวคิดสำคัญและการประยุกต์ใช้งาน",
  "linear-what-title": "โครงสร้างข้อมูลแบบเชิงเส้นคืออะไร?",
  "linear-what-body": "โครงสร้างข้อมูลแบบเชิงเส้นจัดเรียงข้อมูลในลำดับต่อเนื่อง โดยแต่ละองค์ประกอบจะมีตัวก่อนหน้าและตัวถัดไป (ยกเว้นตัวแรกและตัวสุดท้าย) ตัวอย่างทั่วไปได้แก่ อาเรย์ ลิงก์ลิสต์ สแต็ก และคิว",
  "linear-key-title": "ลักษณะเด่น",
  "linear-key-points": [
    "องค์ประกอบถูกจัดเรียงตามลำดับ",
    "ข้อมูลจะถูกประมวลผลตามลำดับ (ทีละรายการ)",
    "เข้าใจและพัฒนาได้ง่าย",
    "การใช้หน่วยความจำสามารถคาดการณ์ได้",
    "การเข้าถึงข้อมูลสามารถทำได้แบบไปข้างหน้าหรือย้อนกลับ"
  ],
  "linear-app-title": "การประยุกต์ใช้งานในชีวิตจริง",
  "linear-app-points": [
    "เพลย์ลิสต์เพลง (เพลงเรียงตามลำดับ)",
    "ประวัติการเข้าชมเว็บเบราว์เซอร์ (หน้าเพจตามลำดับที่เข้าชม)",
    "การจัดตารางงาน (ดำเนินการตามลำดับ)",
    "ฟังก์ชัน Undo/Redo ในแอปพลิเคชัน",
    "คอลสแต็กในภาษาการเขียนโปรแกรม"
  ],

  "timeline-desc": "การจัดเรียงข้อมูลแบบลำดับในแนวนอน เหมาะสำหรับการแสดงผลของอาเรย์และลิงก์ลิสต์",
  "train-desc": "การแทนข้อมูลด้วยขบวนรถไฟที่เชื่อมต่อกัน แสดงถึงการไหลของข้อมูลในทิศทางเดียว",
  "domino-desc": "แสดงการประมวลผลแบบลำดับที่แต่ละการกระทำจะกระตุ้นการทำงานถัดไปต่อเนื่องกัน",
  "stack-desc": "โครงสร้างกองซ้อนในแนวตั้งที่แสดงการทำงานแบบ LIFO (เข้าใหม่ออกก่อน) ซึ่งเป็นหลักการของสแตก",

  "timeline-title": "ไทม์ไลน์คืออะไร?",
  "timeline-sub": "ไทม์ไลน์คือการแทนข้อมูลแบบเส้นตรงที่จัดเรียงตามลำดับ โดยแต่ละองค์ประกอบมีตำแหน่งที่แน่นอนและสามารถเข้าถึงได้โดยตรงผ่านดัชนี",
  "timeline-ops-title": "การดำเนินการ",
  "timeline-ops": [
    "การเข้าถึง: O(1) - เข้าถึงองค์ประกอบใดก็ได้โดยตรง",
    "การแทรก: O(n) - อาจต้องเลื่อนองค์ประกอบ",
    "การลบ: O(n) - อาจต้องเลื่อนองค์ประกอบ",
    "การค้นหา: O(n) - ในกรณีที่เลวร้ายที่สุด"
  ],
  "timeline-app-title": "การประยุกต์ใช้งาน",
  "timeline-app-desc": "อาร์เรย์ ลิงก์ลิสต์ และการประมวลผลข้อมูลแบบลำดับ เช่น ไทม์ไลน์ในโครงการ การจัดเหตุการณ์ทางประวัติศาสตร์ และคู่มือขั้นตอนการทำงาน",

  "train-title": "การแสดงผลลิงก์ลิสต์",
  "train-subtitle": "รถไฟเป็นลิงก์ลิสต์",
  "train-sub": "ภาพจำลองรถไฟแสดงถึงลิงก์ลิสต์ โดยที่แต่ละตู้ (โหนด) จะเก็บข้อมูลและเชื่อมต่อกับตู้ถัดไปตามลำดับ เครื่องยนต์เปรียบเสมือนตัวชี้ไปยังหัวของลิสต์",
  "train-ops-title": "การดำเนินการ",
  "train-ops": [
    "เข้าถึง: O(n) - ต้องวนจากหัวลิสต์",
    "แทรกที่หัว: O(1) - เวลาเท่ากันเสมอ",
    "แทรกที่ท้าย: O(1) - ถ้ามีตัวชี้ไปยังท้ายลิสต์",
    "ลบ: O(1) - ถ้ามีการอ้างอิงโหนด"
  ],
  "train-app-title": "การประยุกต์ใช้งาน",
  "train-app-desc": "ลิงก์ลิสต์ถูกใช้ในตารางสัญลักษณ์ การจัดสรรหน่วยความจำแบบไดนามิก การสร้างโครงสร้างข้อมูลเช่น สแตกและคิว รวมถึงการแทนลำดับกระบวนการที่มีการแทรกหรือลบข้อมูล",

  "domino-title": "การประมวลผลแบบลำดับ",
  "domino-subtitle": "โดมิโนเป็นตัวแทนของการประมวลผลแบบลำดับ",
  "domino-sub": "โดมิโนแสดงให้เห็นถึงการประมวลผลแบบลำดับในคอมพิวเตอร์ ซึ่งงานหนึ่งจะกระตุ้นให้งานถัดไปเริ่มตามลำดับที่กำหนดไว้ เหมือนกับที่อัลกอริธึมแบบลำดับทำงานตามขั้นตอนต่อเนื่องกัน",
  "domino-ops-title": "ลักษณะสำคัญ",
  "domino-ops": [
    "แต่ละขั้นตอนขึ้นอยู่กับการเสร็จสิ้นของขั้นตอนก่อนหน้า",
    "การประมวลผลจะดำเนินตามเส้นทางเดียว",
    "ง่ายต่อการเข้าใจและติดตามลำดับการทำงาน",
    "แต่ละงานต้องรอให้ขั้นตอนก่อนหน้าเสร็จก่อน"
  ],
  "domino-app-title": "การใช้งาน",
  "domino-app-desc": "การประมวลผลแบบลำดับถูกใช้ในการประมวลผลแบบชุด คอมไพเลอร์ ขั้นตอนเริ่มต้นของระบบ การใช้อัลกอริธึม และงานใด ๆ ที่ลำดับของการดำเนินการมีความสำคัญ",
  "stack-title": "การเข้าใจโครงสร้างข้อมูลแบบสแตก (Stack)",
  "stack-what-title": "Stack คืออะไร?",
  "stack-what-desc": "Stack คือโครงสร้างข้อมูลเชิงเส้นที่ทำงานตามหลักการ Last In, First Out (LIFO) เหมือนกับกองไพ่ที่สามารถเพิ่มหรือลบได้เฉพาะด้านบนสุดเท่านั้น",
  "stack-ops-title": "การดำเนินการหลัก",
  "stack-ops": [
    "Push: เพิ่มข้อมูลที่ด้านบนของสแตก - O(1)",
    "Pop: ลบข้อมูลด้านบนสุดของสแตก - O(1)",
    "Peek/Top: ดูค่าด้านบนสุดโดยไม่ลบ - O(1)",
    "isEmpty: ตรวจสอบว่าสแตกว่างหรือไม่ - O(1)"
  ],
  "stack-limit-title": "ข้อจำกัด",
  "stack-limit": [
    "สามารถเข้าถึงได้เฉพาะข้อมูลด้านบนสุดเท่านั้น",
    "ไม่สามารถเข้าถึงข้อมูลแบบสุ่มได้",
    "อาจเกิดการล้นในกรณีที่มีขนาดจำกัด",
    "ต้องใช้การดำเนินการเพิ่มเติมสำหรับงานที่ซับซ้อน"
  ],
  "stack-app-title": "การใช้งานในชีวิตจริง",
  "stack-apps": [
    "Stack ของฟังก์ชันในภาษาโปรแกรม",
    "ฟังก์ชัน Undo/Redo ในโปรแกรมแก้ไข",
    "ประวัติการเข้าชมในเบราว์เซอร์ (ปุ่มย้อนกลับ)",
    "การประเมินนิพจน์และวิเคราะห์ไวยากรณ์",
    "อัลกอริทึม Backtracking เช่น การแก้เขาวงกต การเล่นเกม"
  ]
}
