{
  "about-title": "About Us",
  "about-sub": "Exploring the fascinating world of AI algorithms through interactive visualizations and simulations",
  "about-tab": "About",
  "about-our-project": "Our Project: Interactive AI Visualizations",
  "about-our-project-sub": "Visual Right: AI Playground is an interactive educational platform designed to make complex algorithms and AI concepts accessible through hands-on visualizations and simulations. Our platform features interactive demonstrations of pathfinding algorithms, sorting visualizations, physics simulations, and image processing tools, all designed with a focus on learning through exploration. Check out our simulations. Our goal is to bridge the gap between theoretical knowledge and practical understanding, making computer science and AI concepts more intuitive and engaging for students, educators, and enthusiasts alike.",
  "team-tab": "Team",
  "mission-tab": "Misson",
  "mission-vision-tite": "Our Mission & Vision",
  "mission-title": "Mission",
  "mission-sub": "Our mission is to democratize access to AI and computer science education through interactive, visual learning experiences. We believe that complex concepts become intuitive when you can see them in action and interact with them directly.",
  "vision-title": "Vision",
  "vision-sub": "We envision a world where anyone, regardless of their background or prior knowledge, can understand and engage with the fundamental concepts that power modern technology. By making these concepts accessible and enjoyable to learn, we aim to inspire the next generation of innovators and problem-solvers.",
  "values-title": "Values",
  "accessibility": "Accessibility",
  "accesibility-sub": "Making complex concepts understandable to everyone",
  "interactivity": "Interactivity",
  "interactivity-sub": "Learning through hands-on exploration and experimentation",
  "innovation": "Innovation",
  "innovation-sub": "Continuously improving our visualizations and simulations",
  "community": "Community",
  "community-sub": "Building a supportive environment for learners and contributors",
  "open-source": "Open Source",
  "open-source-sub": "Sharing knowledge and code with the world",
  "impact": "Our Impact",
  "monthly-users": "Monthly Users",
  "interactive-demos": "Interactive Demos",
  "educational-institutions": "Educational Institutions",
  "countries": "Countries",
  "meet-our-team": "Meet Our Team"
}
