{
  "about-title": "เกี่ยวกับเรา",
  "about-sub": "สำรวจโลกของอัลกอริทึม AI อันน่าทึ่งผ่านภาพจำลองและการโต้ตอบเชิงปฏิสัมพันธ์",
  "about-tab": "เกี่ยวกับ",
  "about-our-project": "โปรเจกต์ของเรา: การแสดงภาพ AI เชิงปฏิสัมพันธ์",
  "about-our-project-sub": "Visual Right: AI Playground คือแพลตฟอร์มการเรียนรู้แบบอินเทอร์แอคทีฟ ที่ออกแบบมาเพื่อทำให้แนวคิดเกี่ยวกับอัลกอริทึมและ AI ที่ซับซ้อนเข้าใจง่ายขึ้นผ่านการแสดงภาพและการจำลองที่จับต้องได้ แพลตฟอร์มของเรารวมการสาธิตอินเทอร์แอคทีฟของอัลกอริทึมการหาทางเดิน การแสดงภาพการเรียงลำดับ การจำลองฟิสิกส์ และเครื่องมือประมวลผลภาพ โดยมุ่งเน้นการเรียนรู้ผ่านการสำรวจ เป้าหมายของเราคือการเชื่อมช่องว่างระหว่างความรู้ทางทฤษฎีกับความเข้าใจในทางปฏิบัติ เพื่อทำให้แนวคิดทางวิทยาการคอมพิวเตอร์และ AI เข้าใจได้ง่ายและสนุกสำหรับนักเรียน ครู และผู้ที่สนใจ",
  "team-tab": "ทีมของเรา",
  "mission-tab": "เป้าหมาย",
  "mission-vision-tite": "เป้าหมายและวิสัยทัศน์ของเรา",
  "mission-title": "เป้าหมาย",
  "mission-sub": "เป้าหมายของเราคือการทำให้การศึกษาเกี่ยวกับ AI และวิทยาการคอมพิวเตอร์เข้าถึงได้สำหรับทุกคน ผ่านประสบการณ์การเรียนรู้ที่มองเห็นได้และโต้ตอบได้ เพราะเราเชื่อว่าแนวคิดที่ซับซ้อนจะเข้าใจง่ายขึ้นเมื่อสามารถเห็นและทดลองได้จริง",
  "vision-title": "วิสัยทัศน์",
  "vision-sub": "เรามองเห็นโลกที่ทุกคน ไม่ว่าจะมีพื้นฐานหรือไม่ สามารถเข้าใจและมีส่วนร่วมกับแนวคิดพื้นฐานที่เป็นรากฐานของเทคโนโลยีสมัยใหม่ได้ โดยการทำให้เนื้อหาเหล่านี้เข้าถึงได้และสนุกในการเรียนรู้ เราหวังว่าจะเป็นแรงบันดาลใจให้กับนักประดิษฐ์และนักแก้ปัญหาในอนาคต",
  "values-title": "Values",
  "accessibility": "Accessibility",
  "accesibility-sub": "ทำให้แนวคิดที่ซับซ้อนเข้าใจได้สำหรับทุกคน",
  "interactivity": "Interactivity",
  "interactivity-sub": "เรียนรู้ผ่านการทดลองและสำรวจด้วยตนเอง",
  "innovation": "Innovation",
  "innovation-sub": "พัฒนาเครื่องมือแสดงภาพและการจำลองอย่างต่อเนื่อง",
  "community": "Community",
  "community-sub": "สร้างสภาพแวดล้อมที่สนับสนุนสำหรับผู้เรียนและผู้ร่วมพัฒนา",
  "open-source": "Open Source",
  "open-source-sub": "แบ่งปันความรู้และโค้ดให้กับทุกคน",
  "impact": "Our Impact",
  "monthly-users": "ผู้ใช้ต่อเดือน",
  "interactive-demos": "เดโมเชิงปฏิสัมพันธ์",
  "educational-institutions": "สถาบันการศึกษา",
  "countries": "ประเทศ",
  "meet-our-team": "ผู้พัฒนา"
}
